'use strict';
window.el = implementation;

var implementation = {
    1: {
        hHex: [0,0,0,0,0,0],
        hNum: `<p>Гексограмма № 1<\p>`,
        hName: `<p>Цянь - Творчество<\p>`,
        baseTxt: `
        Вы на вершине горы, и возможности спуститься у Вас нет.
        Так что будьте бдительны и рассудительны, находитесь на-
        верху. Не позднее чем через шесть месяцев ждите крупных 
        перемен. Время благоприятствует Вашим начинаниям.
        Сегодня для Вас очевиден факт участия в какой-либо 
        организации. Вы нуждаетесь в надежном партнере, который,
        кстати, очень скоро появится и исчезнет весьма неожиданно.
        У вас будет свобода выбора важных обстоятельств. В личной
        жизни у вас известная неопределенность, необходимо внести 
        в нее ясность. Если желание Ваше разумно и скромно, оно 
        непременно исполнится. Кто-то противостоит Вам, но, если
        вы будете решительны и непреклонны, вас ожидает успех.
        Испытание Вы выдержите.
        `
    },
    2: {
        hHex: [1,1,1,1,1,1],
        hNum: `<p>Гексограмма № 2<\p>`,
        hName: `<p>Кунь - Исполнение<\p>`,
        baseTxt: `
        Вас ждет какое-либо получение: послания, знака внимания, 
        подарка. Отнеситесь к этой акции с признательностью и с 
        должным вниманием. Проследите за состоянием своего 
        здоровья, на которое Вы в данный момент внимания не 
        обращаете. Сейчас не время давать волю корыстолюбию, так что 
        не думайте слишком много о материальной выгоде. Желание 
        ваше исполнится, хоть и не сразу. В ближайший период  не 
        рекомендуется отправляться в дорогу - ни одному, ни с кем-либо. 
        Скоро в Вашем окружении появится человек, питающий к Вам  
        сильный интерес.
        `
    },
    3: {
        hHex: [0,1,1,1,0,1],
        hNum: `<p>Гексограмма № 3<\p>`,
        hName: `<p>Чжунь - Начальная трудность<\p>`,
        baseTxt: `
        За что бы Вы не брались, все будет валиться из рук, не давая 
        результата. Не остается ничего другого, как ждать более 
        благоприятного времени. По меньшей мере три месяца 
        старайтесь вести замкнутый образ жизни, что, разумеется, вовсе 
        не означает, что в этот период не следует пытаться продумывать 
        планы на будущее. Будьте терпеливы, прислушайтесь к советам 
        женщины. Об удачливости, везении в делах в данный момент не 
        может быть и речи. В качестве намеков на приближающиеся 
        неприятности могут служить незначительные неудачи и 
        разочарования. Вам нужен серьезный анализ своих действий за 
        последние несколько месяцев. Но не отходите с пути в темноту. 
        Оказавшись на глубоководье, научитесь нырять.
        `
    },
    4: {
        hHex: [1,0,1,0,0,1],
        hNum: `<p>Гексограмма № 4<\p>`,
        hName: `<p>Мын - Недоразвитость<\p>`,
        baseTxt: `
        Все вокруг вы видите, будто сквозь некую пелену, но она скоро 
        спадет и мир обретет для Вас ясность. Однако, поскольку в 
        настоящее время нервы Ваши сильно расшатаны, не принимайте 
        скоропалительных решений. Вам не следует ожидать слишком 
        многого от намечающейся в Вашей жизни серьезной перемены. 
        Если хотите добиться успеха, не пренебрегайте советами 
        начальства, вдумайтесь в них, скоро все измениться. Не 
        унывайте. Побольше времени уделяйте общению с детьми. 
        Новые планы. Новые перспективы уже возникают, но даже 
        близко нет новой любви. Сконцентрируйте волю на исполнении 
        одного единственного желания. 
        `
    },
    5: {
        hHex: [0,0,0,1,0,1],
        hNum: `<p>Гексограмма № 5<\p>`,
        hName: `<p>Сюй - Необходимость ждать<\p>`,
        baseTxt: `
        Ждите и собирайтесь с силами, очень скоро они вам понадобятся 
        -  когда наступит весна, сойдет снег и вновь зацветут цветы. 
        Слишком торопливые действия сейчас могут принести вред. 
        Потерпите еще немного, месяца два, пока не явиться некий 
        человек, который поможет вам так, как Вы и не ждете. Если же 
        Вы теперь решительно и энергично займетесь планированием 
        дальнейших действий, то помощь и поддержка придет еще 
        быстрее. Ваше материальное положение внезапно улучшиться. 
        Возможно, вы почувствуете влечение к человеку старше Вас. 
        Старайтесь не слишком обнаруживать свой интерес к нему. 
        Желание ваше исполниться, если Вы будете действовать 
        целеустремленно и в достаточной мере осмотрительно. 
        `
    },
    6: {
        hHex: [1,0,1,0,0,0],
        hNum: `<p>Гексограмма № 6<\p>`,
        hName: `<p>Сун - Суд<\p>`,
        baseTxt: `
        Вы не можете придти в себя от потрясения, которое произошло с 
        Вами недавно. Вы ощущаете дисгармонию. Назревает конфликт, 
        ведите себя скромно и сдержанно, если Вам бросят перчатку, не 
        поднимайте ее. Постарайтесь умерить и свои требования, не 
        пускайтесь ни в какие предприятия  в одиночку, пока 
        обстоятельства не изменятся к лучшему. Напротив примите 
        участия в совместной с кем-либо работе. Пусть все идет своим 
        порядком, тогда наступят мир и покой, и Вы лишний раз 
        убедитесь в том, что жизненные проблемы не только удручают 
        но и учат.
        `
    },
    7: {
        hHex: [1,0,1,1,1,1],
        hNum: `<p>Гексограмма № 7<\p>`,
        hName: `<p>Ши - Войско<\p>`,
        baseTxt: `
        Эта гексаграмма символизирует сознательное уединение. Ваше 
        нынешнее состояние подобно состоянию генерала, решающего, 
        когда лучше всего начать наступление. Будьте внимательны, 
        отбирайте себе  в союзники людей с добрыми намерениями, и 
        хотя удача в данный момент сопутствует Вам, не забывайте о 
        мерах предосторожности. Вы получите неожиданное известие, 
        или Вас посетит неожиданный визитер. Настоящее время 
        исполнено для Вас романтики, что, впрочем, не помешало 
        возникновению разлада с близким человеком. Все будущие дела 
        планируйте тщательно и рассудительно.  Ваши ближайшие 
        перемены будут сведены к переориентации ценностей, к чему 
        Вас вынудят обстоятельства. Займите правильную позицию в 
        общении со своими старшими. Избегайте взаимных упреков и 
        ссор.
        `
    },
    8: {
        hHex: [1,1,1,1,0,1],
        hNum: `<p>Гексограмма № 8<\p>`,
        hName: `<p>Би - Приближение<\p>`,
        baseTxt: `
        Самое худшее уже позади, но кое-какие трудные проблемы еще 
        сохранились. Участвуйте в общих делах, успех ожидает вас в 
        сотрудничестве с другими. Храните верность, не пренебрегайте 
        своими  обязанностями. Исполнение желаний во многом зависит 
        от  того, как Вы воспользуетесь советами начальства и друзей. 
        Вас ждет интерес поиска. Он подогревается обещанным 
        вознаграждением. Приготовьтесь к путешествию, к которому 
        душа у Вас не лежит.
        `
    },
    9: {
        hHex: [0,0,0,1,0,0],
        hNum: `<p>Гексограмма № 9<\p>`,
        hName: `<p>Сяо-чу - Воспитание малым<\p>`,
        baseTxt: `
        Вы находитесь в стадии решения интересного вопроса. Хотя он и 
        не представляет для Вас  ничего серьезного, Ваше старание будет 
        вознаграждено. Везение, успех, не слишком-то характерны для 
        Вашего нынешнего положения, но следует иметь ввиду, что ночь 
        наиболее темна перед  самым рассветом. Обстановка Вам не 
        ясна, Вы не владеете ею, но это переходное состояние. События, 
        которые изменят его к лучшему уже на подходе. А пока 
        наберитесь терпения и ждите. Вас привыкли считать человеком к 
        которому <деньги сами текут в руки>. Будьте 
        предусмотрительны,  не ссорьтесь по мелочам с друзьями и 
        знакомыми, не переусердствуйте в работе, чтобы не измотать 
        себя. Через три месяца деньги действительно потекут к Вам.
        `
    },
    10: {
        hHex: [0,0,1,0,0,0],
        hNum: `<p>Гексограмма № 10<\p>`,
        hName: `<p>Ли - Наступление<\p>`,
        baseTxt: `
        В настоящее время Ваше поведение должно быть подчеркнуто 
        вежливым, дружелюбным и сдержанным. Уйдите в себя и как 
        следует обдумайте свое положение. Каким -либо способом 
        покажите уважение к начальству, сейчас это пойдет Вам на 
        пользу. Произойдет неожиданное событие, которое доставит Вам 
        большую радость. Для флирта время неподходящее. Дамы, 
        общаясь с недостаточно хорошо знакомыми мужчинами, должны 
        быть особенно осторожны. Это период, когда претензии к жизни 
        следует снизить до минимума. Приготовьтесь к новой роли, 
        возможности самовыражения. Не очень доверяйте своему 
        новому знакомому, который в силу своего характера, без умысла 
        может навредить Вам.
        `
    },
    11: {
        hHex: [0,0,0,1,1,1],
        hNum: `<p>Гексограмма № 11<\p>`,
        hName: `<p>Тай - Расцвет<\p>`,
        baseTxt: `
        Сейчас, когда счастье благоволит Вам и карьера Ваша 
        продвигается вперед и вверх, именно сейчас подумайте о 
        друзьях.  В то же время не будьте легкомысленны и небрежны. 
        Если хотите, чтобы везение и успех сопутствовали Вам как  
        можно дольше, постарайтесь подкрепить их успехами и в других 
        областях. Желание ваше исполнится, но не стремитесь 
        искусственно ускорить его осуществление. Данный период 
        характерен завершением какого-либо дела и новыми 
        начинаниями. От Вашего усердия зависит, будут ли новые 
        начинания успешны. Ждите гостей. Вам следует показаться 
        врачу, хотя ничего серьезного в Ваших недомоганиях нет.  
        `
    },
    12: {
        hHex: [1,1,1,0,0,0],
        hNum: `<p>Гексограмма № 12<\p>`,
        hName: `<p>Пи - Упадок<\p>`,
        baseTxt: `
        Вам многое не ясно, волнуют проблемы общественной жизни. К 
        Вам тянуться люди ,не достойные Вас. Будьте бдительны и 
        предусмотрительны, не принимайтесь ни за что существенное. 
        Ваше окружение не понимает Вас; Вы без достаточных на то 
        оснований ссоритесь с одним из друзей. Желания Ваши 
        исполняться на  три четверти, но и то не сразу. В эти дни следите 
        за своим кошельком. Прислушивайтесь к советам начальства, но 
        решения принимайте по собственному усмотрению. Положение 
        скоро изменится. В ближайшей перспективе Вас ждет встреча с 
        интересным человеком. В семье Вас ждет полный порядок, хотя 
        могут и наблюдаться нервные срывы со стороны отдельных 
        членов семьи.
        `
    },
    13: {
        hHex: [0,1,0,0,0,0],
        hNum: `<p>Гексограмма № 13<\p>`,
        hName: `<p>Тунжэн - Единомышленники<\p>`,
        baseTxt: `
        Нынешний период характерен расходящимися путями. В выборе 
        их надейтесь на интуицию. Куда бы Вы не отправились, попадете 
        в хорошее общество. Можете смело вступать в борьбу, преследуя 
        высокие цели: Вас поддержит человек на которого Вы не 
        рассчитывали. Очень скоро дела Вши пойдут на лад. Вы 
        несколько не уверенны и беспокойны, это следствие легкого 
        стресса, в котором Вы пребываете. Тем не менее желание Ваше 
        исполниться, причем настолько полно, насколько серьезно Вы 
        отнесетесь к предполагаемой помощи старших.
        `
    },
    14: {
        hHex: [0,0,0,0,1,0],
        hNum: `<p>Гексограмма № 14<\p>`,
        hName: `<p>Да-ю - Обладание великим<\p>`,
        baseTxt: `
        Вы ощущаете себя сейчас особенно свободным: кроме того Вы 
        волне богаты - как с материальной, так и с духовной точки 
        зрения. Сконцентрируйте волю на исполнении тех своих 
        желаний, осуществление которых необходимо для успеха в 
        делах. Хотя  данный период благоприятен для Вас, старайтесь не 
        перегружать себя, постоянно держите в поле зрения главную 
        цель. Время показывает на необходимость позаботиться о своем 
        здоровье. Вас ждет приятная встреча, которая наложит отпечаток 
        на дальнейшую деятельность.
        `
    },
    15: {
        hHex: [1,1,0,1,1,1],
        hNum: `<p>Гексограмма № 15<\p>`,
        hName: `<p>Цянь - Смирение<\p>`,
        baseTxt: `
        Обстоятельства Ваши в данный момент можно назвать лишь 
        <<умеренно благоприятными>>. Если поведение Ваше будет 
        отличаться сейчас умеренностью и сдержанностью, в 
        последствии Вы станете хозяином положения. В настоящее 
        время по ряду причин, в том  числе  финансового порядка, Вы 
        испытываете некоторое замешательство и беспокойство, но не 
        тревожьтесь, скоро все изменится к лучшему. Если не отвергните 
        помощи других, желание Ваше исполнится. Вас ожидает 
        необходимость закончить давно начатое занятие. Эту работу 
        сделайте своим главным делом. Одновременно с избавлением от 
        старого, Вы освободитесь от напряжения и неуверенности.
        `
    },
    16: {
        hHex: [1,1,1,0,1,1],
        hNum: `<p>Гексограмма № 16<\p>`,
        hName: `<p>Юнь - Вольность<\p>`,
        baseTxt: `
            Предстоящий период характерен Вашим участием (косвенным 
            или прямым) в вопросах, связанных с земледелием, к которым 
            проявите интерес. Вы ощущаете прилив сил, которые помогут 
            добиться намеченного. Будьте благоразумны в своих поступках. 
            Будьте готовы к успеху, который скоро последует. Счастье будет 
            сопутствовать Вам в осуществлении новых замыслов. Шагая по 
            пути успеха не забывайте смотреть под ноги, чтобы не 
            погрязнуть в мелочности и меркантильности. Будьте осторожны, 
            не тратьте слишком много.
        `
    },
    17: {
        hHex: [0,1,1,0,0,1],
        hNum: `<p>Гексограмма № 17<\p>`,
        hName: `<p>Суй - Последование<\p>`,
        baseTxt: `
        Время больше подходит для упрочения руководящих позиций, 
        нежели для вербовки сторонников. Будьте верны своим 
        принципам даже в том случае, если цели Ваши изменятся. 
        Впредь довольствуйтесь пока малыми победами и успехами , они 
        немедленно повлекут за собой  и более крупные. Плывите по 
        течению, а не против него, и тогда все придет в порядок. 
        Желание Ваше исполниться с большей долей вероятности, но 
        будьте готовы к серьезным переменам в жизни. Не принимайте 
        близко к сердцу отдельные неприятности, которые Вас 
        сопровождают в последнее время. Здесь требуется очищение. 
        Начинайте с самого трудного и двигайтесь к тому, что не 
        сложно.
        `
    },
    18: {
        hHex: [1,0,0,0,0,1],
        hNum: `<p>Гексограмма № 18<\p>`,
        hName: `<p>Гу - Испоравление (порчи)<\p>`,
        baseTxt: `
        Вы станете участником ряда перемен и преобразований в личной 
        жизни других. Тщательно анализируйте, оценивайте события. 
        Вам следует быть хозяином положения, что постепенно станет 
        возможным само собой  благодаря Вашему  нынешнему 
        состоянию. Вы можете потерять друга. Скоро Вы совершите 
        нечто такое, что ошеломит Ваших знакомых, а быть может, и 
        Вас самих. Отношения с окружающими у Вас не в порядке, 
        возникающие отсюда проблемы способны помешать 
        исполнению Ваших желаний, так что отношения необходимо 
        прояснить. Будьте предусмотрительны! Тратите Вы слишком 
        много. Проанализируйте очень важное сообщение, полученное 
        от близкого человека. Оно сыграет не последнюю роль в Вашей 
        повседневной жизни.

        `
    },
    19: {
        hHex: [0,0,1,1,1,1],
        hNum: `<p>Гексограмма № 19<\p>`,
        hName: `<p>Линь - Посещение<\p>`,
        baseTxt: `
        За что бы Вы ни взялись сейчас, Вас ждет успех. И чем больше 
        результатов Вы добьетесь, тем удачнее будут складываться 
        обстоятельства. Близится период, во время которого возможны 
        крупные успехи сразу во многих делах и сферах деятельности. 
        Решительно добивайтесь намеченных целей, но при этом будьте 
        осмотрительны, чтобы не обидеть, не рассердить и не вызвать 
        зависть друзей. Один из близких Вам  людей, которого Вы очень 
        хорошо знаете, вынудит Вас изменить к нему отношение. Вы 
        получите неприятное сообщение от близкого человека. Однако 
        расстраиваться не следует, так как в ближайшее время все 
        уладиться.
        `
    },
    20: {
        hHex: [1,1,1,1,0,0],
        hNum: `<p>Гексограмма № 20<\p>`,
        hName: `<p>Гуань - Созерцание<\p>`,
        baseTxt: `
        Будьте готовы к неприятному сюрпризу. Постарайтесь 
        рассудительно и детально осмыслить положение дел, увидеть их 
        так, как они обстоят в действительности. Возможно Вам 
        придется сменить место работы и жительства. Сейчас Вам 
        необходимо быть особенно внимательным, не позволяйте 
        важным вещам ускользать за пределы Вашего влияния. 
        Тщательно продумывайте все действия и тогда получите помощь 
        от туда, откуда меньше всего ждете. Желания исполнятся, но не 
        так быстро как бы Вам хотелось. Хорошенько обдумайте 
        возможность осуществления Ваших планов, а если дела пойдут 
        успешно не забывайте помогать другим. Вас ждет приобретение 
        о котором Вы долго мечтали. 
        `
    },
    21: {
        hHex: [0,1,1,0,1,0],
        hNum: `<p>Гексограмма № 21<\p>`,
        hName: `<p>Ши-хо - Стиснутые зубы<\p>`,
        baseTxt: `
        Что-то мучает Вас, Вы чувствуете себя несчастным. Попробуйте 
        взяться за новое дело, и обстоятельства Ваши улучшаться. 
        Добросовестная работа постепенно и неуклонно приведет Вас к 
        очень крупному успеху. Вы считаете себя жертвой 
        несправедливости. Если будете постоянно думать о том, что 
        такое могло случиться, делу это не поможет. Очевидно, в чем-то 
        Вы допустили ошибку, одну из тех, какие в огромном множестве 
        допускают и другие. Наберитесь мужества и извлеките из 
        случившегося должный урок. Что касается исполнения Вашего 
        желания, то как раз сейчас кое-кто содействует этому. 
        Оставайтесь рассудительным и ждите спокойно, тогда очень 
        скоро все перемениться к лучшему для Вас.
        `
    },
    22: {
        hHex: [0,1,0,0,0,1],
        hNum: `<p>Гексограмма № 22<\p>`,
        hName: `<p>Би - Убранство<\p>`,
        baseTxt: `
        Вас ожидает значительное расстройство, потеря собственности - 
        от незначительной до очень серьезной. Не проявляйте 
        беспомощность и не впадайте в панику. Главное на данном этапе 
        - трезво оценить обстановку и выбрать правильные действия. 
        Неприятный период завершиться неожиданным знакомством с 
        приятным человеком. Вы примете очень серьезное решение, 
        которое изменит Ваше ближайшее будущее. Вы начнете новое 
        дело.
        `
    },
    23: {
        hHex: [1,1,1,1,1,0],
        hNum: `<p>Гексограмма № 23<\p>`,
        hName: `<p>Бо - Разрушение<\p>`,
        baseTxt: `
        В ближайшем будущем Вас ожидают крупные перемены. Сейчас 
        не принимайтесь ни за какое новое дело. Вам нельзя попадать в 
        глупое положение. Возможно, кто-то злословит по Вашему 
        адресу, распускает сплетни. Желания Ваши исполнятся чуть 
        позже. Не робейте, если в какой-то момент окажется, что нельзя 
        рассчитывать на помощь друзей. Будьте осмотрительны в 
        общении с лицемерными представителями другого пола.
        `
    },
    24: {
        hHex: [0,1,1,1,1,1],
        hNum: `<p>Гексограмма № 24<\p>`,
        hName: `<p>Фу - Возврат<\p>`,
        baseTxt: `
        Вам кажется, что Вы совершенно запутались в окружающей 
        обстановке и Вы сильно нервничаете по этому поводу, однако 
        помехи малосущественны и Вы справитесь с ними очень скоро, 
        если будете усердно и добросовестно работать. Некий, вполне 
        определенный срок - семь дней или семь недель, а быть может, 
        семь месяцев - обретет для Вас большое значение. По всей 
        вероятности, Вы и сами чувствуете, что стоите на пороге 
        серьезных перемен в судьбе, и это действительно так. Еще 
        немного, и все устроится. Постепенно, монетка к монетке, 
        скапливайте деньги. Решительно и неудержимо устремитесь Вы 
        новым путем. Вам предстоит очень серьезное испытание, 
        которое закончится вполне успешно. Не самообольщайтесь. 
        Впереди новые испытания. 
        `
    },
    25: {
        hHex: [0,1,1,0,0,0],
        hNum: `<p>Гексограмма № 25<\p>`,
        hName: `<p>У-Ван - Беспорочность<\p>`,
        baseTxt: `
        Вы заняты подготовкой к ответственному периоду своей жизни. 
        Вас ждут крупные перемены, которые на первых порах будут 
        складываться не весьма приятно. Проявив волю и энергию, 
        добьетесь крупного успеха. Судьба скоро улыбнется Вам, но 
        лишь в том случае, если вы умеете терпеливо ждать. Порой Вы 
        слишком озабочены любовными делами. Вашей деятельностью 
        заинтересуется близкий Вам человек, который сделает вам 
        предложение. Все Ваши желания исполнятся в срок. 
        `
    },
    26: {
        hHex: [0,0,0,1,1,0],
        hNum: `<p>Гексограмма № 26<\p>`,
        hName: `<p>Да-чу - Воспитание великим<\p>`,
        baseTxt: `
        Не тратьте понапрасну силы, в Вашей судьбе наступила <пауза>. 
        Ждите ее окончания в полной готовности, не разменивайте 
        энергию по мелочам, скоро ей найдется более приятное и 
        полезное применение. Желания исполнятся, но лишь в том 
        случае, если планку Вы установите не слишком высоко. Помощь 
        придет от тех, кто столкнулся с проблемами, подобными Вашим. 
        Не пытайтесь силой ускорить ход вещей, результат может 
        оказаться обратным. Вам симпатизирует один из Ваших 
        знакомых. Проявите к нему благоразумие и вы поймете, что 
        поступаете правильно. В своем поведении придерживайтесь 
        чувства меры.
        `
    },
    27: {
        hHex: [0,1,1,1,1,0],
        hNum: `<p>Гексограмма № 27<\p>`,
        hName: `<p>И - Питание<\p>`,
        baseTxt: `
        Вы слишком много говорите, и слишком много едите. Не 
        сплетничайте о других, так Вы вредите не только им , но и себе. 
        Желание исполнится, но несколько иначе, чем Вам хотелось. 
        Прекратите сетовать на судьбу. Вам было бы не лишне 
        показаться врачу. Будьте готовы к скорым переменам в жизни, 
        которые связаны с ожиданием результатов. Следует помнить, что 
        быстрых результатов ожидать нельзя. Нужен промежуток 
        времени для окончательной благоприятной развязки. Вы 
        посадили семя, ждите терпеливо всходов.
        `
    },
    28: {
        hHex: [1,0,0,0,0,1],
        hNum: `<p>Гексограмма № 28<\p>`,
        hName: `<p>Да-го - Переразвитие великого<\p>`,
        baseTxt: `
        Вы ощущаете себя очень счастливым. Желательно взять себя в 
        руки, поскольку Ваш темперамент, если дать ему волю, может 
        повредить как другим, так и Вам самому. Не будьте излишне 
        самоуверенны, Ваши суждения в настоящее время отнюдь не 
        самые верные. Не пытайтесь добиваться успеха силой. Сдержите 
        себя и поразмыслите над состоянием дел. Время все изменит. 
        Желание Ваше может исполниться быстро. Остерегайтесь 
        обидеть своей горячностью других. Вам сейчас, как никогда, 
        нужна твердость воли. Один из выигрышей может исходить от 
        чего-то, с чем Вы должны расстаться.
        `
    },
    29: {
        hHex: [1,0,1,1,0,1],
        hNum: `<p>Гексограмма № 29<\p>`,
        hName: `<p>Си-кань - Повторная опасность<\p>`,
        baseTxt: `
        Очень неприятная гексаграмма. В настоящее время для Вашей 
        жизни характерны потери и поражения. Единственное, что Вы 
        можете сделать, это сократить до возможного минимума число 
        ударов судьбы. Наберитесь терпения и ждите, пока богиня 
        счастья вновь удостоит Вас взгляда. Времени у Вас много, 
        займитесь научными или иными интересными для Вас 
        изысканиями. Через два, самое большее - через пять месяцев 
        положение начнет изменяться к лучшему. До тех пор храните 
        спокойствие и не падайте духом. Это период, когда самоанализ и 
        трезвая оценка положения гораздо важнее, чем отчаянная борьба 
        с судьбой.
        `
    },
    30: {
        hHex: [0,1,0,0,1,0],
        hNum: `<p>Гексограмма № 30<\p>`,
        hName: `<p>Ли - Сияние<\p>`,
        baseTxt: `
        Внешне все обстоит превосходно, но в действительности это не 
        так. Вы в плену иллюзий , если не сказать сознательного 
        самообмана. Прислушайтесь к советам друга. Судьба в данный 
        момент благоволит Вам, но это обманчивое впечатление, оно 
        может ввести в заблуждение и нанести серьезный ущерб, если 
        Вы целиком положитесь на фортуну. Желание Ваше исполнится 
        благодаря вмешательству человека старше Вас. В делах, 
        связанных с сочинительством и посредничеством, возможны 
        крупные успехи. Прислушайтесь к тому, что говорят люди. В 
        любовных делах Вас ждет разочарование.  
        `
    },
    31: {
        hHex: [1,1,0,0,0,1],
        hNum: `<p>Гексограмма № 31<\p>`,
        hName: `<p>Сянь - Взаимодействие<\p>`,
        baseTxt: `
        Душевному состоянию в котором Вы пребываете, обычно 
        сопутствует везение и успех. Вы настроены на <хорошую волну>. 
        Близятся несколько неожиданных и выгодных для Вас событий, 
        почти каждый ваш шаг принесет удачу. Реальные результаты 
        превысят даже самые смелые ожидания, что внесет в Вашу душу 
        небывалый покой. Единственный негативный фактор: после всех 
        треволнений возникает необходимость ненадолго уйти от дел и 
        отдохнуть. И хотя состояние Вашего здоровья не подает никаких 
        тревожных сигналов, переведите дух от мирской суеты и 
        пообщайтесь со своим лечащим врачом.
        `
    },
    32: {
        hHex: [1,0,0,0,1,1],
        hNum: `<p>Гексограмма № 32<\p>`,
        hName: `<p>Хэн - Постоянство<\p>`,
        baseTxt: `
        Вы разрываетесь на части, пытаясь двигаться сразу в двух 
        направлениях. Если сохраните выдержку, все завершится с 
        пользой для вас. Не стремитесь к переменам. Желание Ваше 
        исполнится, если Вы будете терпеливы. Не лишне сейчас 
        провести <внутреннюю инвентаризацию> и попытаться как 
        следует разобраться в дальнейших планах, намерениях. В один из 
        ближайших религиозных праздников Вы получите очень 
        интересное сообщение, которое окажет некоторое влияние на 
        ход Вашей творческой работы. Ждите гостей.
        `
    },
    33: {
        hHex: [1,1,0,0,0,0],
        hNum: `<p>Гексограмма № 33<\p>`,
        hName: `<p>Дунь - Бегство<\p>`,
        baseTxt: `
        Вы только выиграете, если немного сдержите себя. Напористость 
        в данный момент пользы не принесет. Эта гексаграмма 
        благоприятная для интересного отдыха и развлечений, а также 
        для консолидации планов на будущее. Осуществление планов 
        отложите до окончания нынешнего периода неопределенности. 
        Используйте его для медитации. Вашей заботой является  
        печальный факт нарушения связи со своими близкими Ищите 
        объяснение этому в своем характере. Проявите мудрость и 
        настройте себя на мирный лад. Вынуждаетесь в утешении от 
        своих домашних невзгод.       
        `
    },
    34: {
        hHex: [0,0,0,0,1,1],
        hNum: `<p>Гексограмма № 34<\p>`,
        hName: `<p>Да-чжуань - Мощь великого<\p>`,
        baseTxt: `
        Вы стремитесь на передний план слишком активно, более чем 
        это выгодно Вам в данное время. Вы готовы растоптать 
        окружающих, что, мягко выражаясь, не доставило бы им 
        удовольствия. В честолюбии нет ничего плохого, но оно 
        непременно должно сопровождаться тактичностью в обращении 
        с людьми. Желание ваше исполнится, если Вы будете вести себя 
        несколько скромнее. Оставаться скромным  - совет древних. 
        Независимо от того, каковы Ваши заслуги, будьте уступчивым, 
        сосредоточенным и умеренным. Ждите приятных новостей от 
        своих близких.       
        `
    },
    35: {
        hHex: [1,1,1,0,1,0],
        hNum: `<p>Гексограмма № 35<\p>`,
        hName: `<p>Цзинь - Восход<\p>`,
        baseTxt: `
        Еще совсем недавно Вас сопровождала неясность ближайшего 
        будущего. Постепенно все становится на свои места. Удача на 
        подходе. К вам придут уважение и признание, на которые Вы по 
        праву рассчитывали. В будущем вознаграждение будет еще 
        выше. Положитесь на свою счастливую звезду и смело шагайте 
        вперед: при этом пусть вас не печалит, что желание ваше 
        исполнится лишь с некоторой задержкой. Вы неожиданно 
        встретитесь с человеком, которого не видели очень давно. 
        Постарайтесь тратить не много, в дальнейшем такая экономность 
        воздастся Вам сторицей. Вас заинтересует предложение вашего 
        знакомого о новом совместном производстве.        
        `
    },
    36: {
        hHex: [0,1,0,1,1,1],
        hNum: `<p>Гексограмма № 36<\p>`,
        hName: `<p>Мин-и - Поражение света<\p>`,
        baseTxt: `
        В настоящее время Вам сопутствует удача, но не будьте слишком 
        самонадеянны, ситуация скоро изменится. Действуйте обдуманно 
        и предусмотрительно, не увлекайтесь любовными авантюрами. 
        Со стороны Вы производите впечатление баловня судьбы, и 
        поэтому, вполне возможно, что окружающие истолковывают 
        Ваши поступки превратно, но не тревожьтесь, в ближайшем 
        будущем все станет на свои места. Желания Ваши сейчас не 
        исполнятся. Будьте экономны. Ждите новости, которая заставит 
        изменить Ваши планы.        
        `
    },
    37: {
        hHex: [0,1,0,0,1,1],
        hNum: `<p>Гексограмма № 37<\p>`,
        hName: `<p>Цзя-жэнь - Домащние<\p>`,
        baseTxt: `
        Ваше место там, куда тянет сердце, там же Вас ждет и 
        благополучие. Надежды исполнятся с посторонней помощью. 
        Возможно, про себя Вы думаете, что где-то трава зеленее, но 
        поверьте, если покинете сейчас свой край, очень скоро 
        убедитесь, что совершили ошибку. Наслаждайтесь семейной 
        жизнью, общением с друзьями, покоем в доме. Если Вы 
        чувствуете преграду, будьте честны с самим собой. Не думайте 
        об окружающих, а спокойно проанализируйте свою 
        деятельность, и Вы поймете, как необходимо в данный момент 
        уйти от прошлых привычек.      
        `
    },
    38: {
        hHex: [0,0,1,0,1,0],
        hNum: `<p>Гексограмма № 38<\p>`,
        hName: `<p>Куй - Разлад<\p>`,
        baseTxt: `
        Эта гексаграмма означает, что данный период Вашей жизни 
        лишен гармонии. Вам кажется, будто все вокруг придираются к 
        Вам, настроены злонамеренно. Даже самые незначительные 
        мелочи выводят Вас из себя. Успокойтесь, не нервничайте, 
        положение скоро исправится. Сподвижников Вам сейчас найти 
        трудно. Некая женщина действует Вам на нервы. Следите за  
        своими словами и не принимайтесь ни за что новое. В поле 
        Ваших интересов, в данный момент находится целый ряд вещей, 
        совершенно не соответствующих Вашим истинным желаниям. 
        Вас ждут перемены, к которым Вы не подготовлены. Суть 
        перемен - перемещение по службе.       
        `
    },
    39: {
        hHex: [1,1,0,1,0,1],
        hNum: `<p>Гексограмма № 39<\p>`,
        hName: `<p>Цзянь - Препятствие<\p>`,
        baseTxt: `
        Одна из худших гексаграмм. Чем больше усилий Вы прилагаете, 
        тем дальше оказываетесь оттесненным назад. Трудно сказать 
        почему именно, но в данный момент фортуна Вам не улыбается. 
        Лучше всего сейчас погрузится в такую деятельность, которая 
        даст успокоение. Вполне возможно, что несколько Ваших друзей 
        придут Вам на помощь, окажут поддержку. Следите за своими 
        расходами: в этот недобрый период реальна опасность остаться 
        без средств. В недалеком будущем Вас ждет дорога. 
        Единственным утешением для Вас будет общение с очень 
        дорогим человеком.
        `
    },
    40: {
        hHex: [1,0,1,0,1,1],
        hNum: `<p>Гексограмма № 40<\p>`,
        hName: `<p>Цзе - Разрешение<\p>`,
        baseTxt: `
        Вы пережили долгий период беспокойства и неприятностей. 
        Этому периоду настал момент. В работе снова будет успех. 
        Немедленно начинайте действовать, иначе упустите возможность 
        добиться великолепного результата. Некое старое Ваше желание 
        исполниться, новое -тоже, но чуть позже. У вас появятся новые 
        друзья. Если отправитесь в путешествие, оно доставит вам 
        огромное удовольствие. Начавшийся период благоприятен для 
        того, чтобы хорошо заработать.
        `
    },
    41: {
        hHex: [0,0,1,1,1,0],
        hNum: `<p>Гексограмма № 41<\p>`,
        hName: `<p>Сунь - Убыль<\p>`,
        baseTxt: `
        То, что Вы сегодня отдаете другим, завтра судьба возвратит Вам 
        с процентами. Быть может, Вам сейчас кажется, будто Вы 
        слишком расточительны, слишком одариваете других, но это 
        впечатление скоро пройдет и Вы будете щедро вознаграждены. 
        Приглядитесь внимательно к сложившейся - непростой для Вас 
        обстановке. Время благоприятствует обдумыванию планов и  
        интеллектуальной деятельности. Вам нужно сохранить 
        достигнутое. Наслаждайтесь своей удачей и не забывайте 
        поделится ею. Большинство Ваших желаний исполнится, причем 
        пожнете Вы даже больше, чем сеяли.
        `
    },
    42: {
        hHex: [0,1,1,1,0,0],
        hNum: `<p>Гексограмма № 42<\p>`,
        hName: `<p>И - Преумножение<\p>`,
        baseTxt: `
        Время благоприятствует выдающимся личностям, но и для 
        прочих оно плодотворно. Осуществится задуманное, будет 
        оплачено сделанное. Вы сможете оказать помощь другим. Некое 
        дело, которое Вам поручит начальство, обернется личной 
        выгодой для Вас. Кто-то готовится сделать Вам личное 
        предложение. Желание исполнится с помощью вышестоящего 
        лица. В ближайшем будущем - возможность неожиданно, но 
        существенно поправить финансовые дела. Готовьтесь к 
        приглашению на семейное торжество.
        `
    },
    43: {
        hHex: [0,0,0,0,0,1],
        hNum: `<p>Гексограмма № 43<\p>`,
        hName: `<p>Гуай - Выход<\p>`,
        baseTxt: `
        В настоящий период Вы удачливы, но легко может случится, что 
        из-за собственного упрямства совершите ошибку и оттолкнете от 
        себя тех, кто обычно помогал Вам. Пойдите сами им навстречу и 
        проявляйте больше терпимости в отношениях с ними. Вполне 
        возможно, что в этот период Вы полюбите человека, которому 
        мало симпатизируете, и это, разумеется, окажет влияние на Ваше 
        поведение. Намечающиеся сдвиги во взаимоотношениях со 
        старшими  принесут приятное изменение всего хода событий. 
        Вас ждет повышение по службе, которое потребует проявления 
        усердия и всех добрых бойцовских качеств.
        `
    },
    44: {
        hHex: [1,0,0,0,0,0],
        hNum: `<p>Гексограмма № 44<\p>`,
        hName: `<p>Гоу - Перечение<\p>`,
        baseTxt: `
        Хорошо, если характерной чертой Вашего нынешнего поведения 
        будет сдержанность. Отнеситесь внимательно к переменам в 
        контактах с людьми и попытайтесь оценивать их действия менее 
        критично. Исполнение желаний и надежд проблематично. Будьте 
        экономны. Внутренне подготовьтесь к тому, что скоро 
        последуют неожиданные события, не сулящие Вам ничего 
        благоприятного. Вас ждет встреча с родственниками, из которой 
        Вы узнаете много интересного. Это будет информация для 
        размышления.  
        `
    },
    45: {
        hHex: [1,1,1,0,0,1],
        hNum: `<p>Гексограмма № 45<\p>`,
        hName: `<p>Цуй - Воссоединение<\p>`,
        baseTxt: `
        Все, что сделаете в этот период, за что приметесь, завершится 
        успешным результатом. Некая невидимая сила упрочит Ваши 
        отношения с людьми, поможет завязать новые тесные контакты, 
        которые так или иначе станут для Вас благоприятными. Былые 
        труды и усилия будут оплачены. Вас преследует женщина, она 
        стремится преградить Вам путь, помешать осуществлению 
        Ваших намерений, вмешаться в Вашу жизнь. Несмотря на это, 
        желания Ваши исполнятся. Остерегайтесь одного из Ваших 
        сослуживцев, который питает к Вам чрезмерное чувство зависти.
        `
    },
    46: {
        hHex: [1,0,0,1,1,1],
        hNum: `<p>Гексограмма № 46<\p>`,
        hName: `<p>Цэн - Подъем<\p>`,
        baseTxt: `
        То, над чем Вы трудитесь уже долгое время, наконец даст 
        благоприятный результат и будет оплачено. Надо только еще 
        немного поработать настойчиво и добросовестно, тогда вскоре 
        можно рассчитывать на высокую  оценку и признание. Смелые и 
        решительные действия сейчас более благоприятны, чем 
        бездеятельное выжидание. Положитесь на свой здравый смысл и 
        интуицию, и тогда желание Ваше наверняка исполнится. Идеи, 
        которые Вы в данный момент обдумываете, скорее всего 
        принесут успех и в финансовом смысле.
        `
    },
    47: {
        hHex: [1,0,1,0,0,1],
        hNum: `<p>Гексограмма № 47<\p>`,
        hName: `<p>Кунь - Истощение</p>`,
        baseTxt: `
        Вам выпала неважная гексаграмма. Это не тот период, когда 
        стоило бы приниматься за что-либо. Затаитесь и ждите. Мысли 
        Ваши недостаточно ясны. Некто из Вашего окружения, 
        занимающий высокое общественное положение, протянет Вам 
        руку помощи. Прислушайтесь к советам этого человека. Вера в 
        собственные силы у Вас сейчас очень слабая. Но не принимайте 
        события слишком трагично, ведь этот негативный период 
        пройдет и обстоятельства Ваши улучшатся. Вас ждет дорога, 
        которая поможет отвлечься от мрачных мыслей. Вас будут 
        агитировать для участия в одной религиозной акции.   
        `
    },
    48: {
        hHex: [1,0,0,1,0,1],
        hNum: `<p>Гексограмма № 48<\p>`,
        hName: `<p>Цзин - Колодец</p>`,
        baseTxt: `
        Хорошо, если Вы протянете другим руку помощи, даже если у 
        Вас самого дела идут не вполне гладко. Впоследствии Вы 
        убедитесь, что такой образ действий очень выгоден. В данный 
        период едва ли можно рассчитывать на признание Ваших 
        способностей и достижений начальством, что, конечно, 
        малоприятно. Вы страстно желаете, чтобы обстоятельства 
        изменились, но время сейчас не благоприятствует этому. 
        Скромные Ваши желания могут исполниться и теперь, а вот 
        крупные, нет. Этот период означает маленькое испытание на 
        твердость духа Вашего характера.
        `
    },
    49: {
        hHex: [0,1,0,1,1,0],
        hNum: `<p>Гексограмма № 49<\p>`,
        hName: `<p>Гэ - Смена</p>`,
        baseTxt: `
        Все вокруг вас пребывает сейчас в движении, все меняется, но в 
        конце концов добрые результаты превзойдут даже самые смелые 
        Ваши ожидания. В настоящий момент Вы не чувствуете  в себе 
        уверенности, но скоро она вновь вернется к Вам вместе с новыми 
        перспективами, обстоятельства изменятся к лучшему. Вы 
        измените свои недавние планы и отправитесь туда, куда прежде и 
        не собирались. Нынешний период характерен и тем, что Вам 
        надлежит выбрать правильную защиту от возможных действий 
        ваших недругов. Помните, что своевременное действие и 
        правильное поведение - единственное, что дает настоящую 
        защиту. В игре Вы сейчас удачливы.
        `
    },
    50: {
        hHex: [1,0,0,0,1,0],
        hNum: `<p>Гексограмма № 50<\p>`,
        hName: `<p>Дин - Жертвнник</p>`,
        baseTxt: `
        Эта гексаграмма имеет для Вас позитивное значение, если 
        решительно возьмете на себя роль инициатора. Кое-кого Ваши 
        успехи не радуют, но не обращайте на этих людей внимания. 
        Остерегайтесь брать на себя или обещать больше, чем в 
        состоянии выполнить. Сильное влияние на Вас и на Ваши 
        отношения с людьми имеет цифра <три>. Дело, за которое Вы 
        принялись с двумя единомышленниками, приведут Вас к успеху. 
        Желание исполнится, хотя и не совсем так, как Вы изначально 
        задумывали. Вас ждет удовлетворенное честолюбие от 
        полученной награды, счастливой любви. Остерегайтесь 
        пакостных действий со стороны Вашего знакомого, проявленных 
        на почве зависти.
        `
    },
    51: {
        hHex: [0,1,1,0,1,1],
        hNum: `<p>Гексограмма № 51<\p>`,
        hName: `<p>Чжэнь - Возбуждение</p>`,
        baseTxt: `
        Вы близки к успеху, но кто-то прилагает силы, чтобы помешать 
        Вам его достигнуть. Не расстраивайтесь из-за этого. То, что Вы 
        стремились получить как необходимое Вам, на деле окажется 
        совершенно другим, не таким каким представлялось, так что 
        смело и со спокойной душой можете уступить это сопернику. 
        Скоро в Вашем окружении произойдет нечто неожиданное и 
        неприятное, впрочем это событие ничем не повредит Вам. 
        Период благоприятен для отдыха. Не нервничайте из-за того, что 
        обстоятельства складываются именно так, а не иначе. 
        Рассматривайте этот период как испытания в дальнейшем. 
        Сложившаяся обстановка закалит Вас как бойца. Несколько 
        позднее и Вам улыбнется удача.
        `
    },
    52: {
        hHex: [1,1,0,1,1,0],
        hNum: `<p>Гексограмма № 52<\p>`,
        hName: `<p>Гэнь - Сосредоточенность</p>`,
        baseTxt: `
        В настоящее время прогресс в делах проблематичен. Очевидно 
        следует переждать немного и лишь затем снова приступить к 
        работе. От запланированной поездки лучше отказаться. 
        Примиритесь с обстоятельствами и тщательно обдумайте свое 
        положение, прежде чем браться за что-либо. Предстоящий 
        период потребует от Вас проявления предвидения и 
        настойчивости. Предотвращайте ожидаемые трудности с 
        помощью обдуманных действий. Отнеситесь благосклонно к 
        действиям близких, которые хотят оказать Вам помощь. Выше 
        голову! Победа над трудностями и кознями недоброжелателей 
        будет за Вами, причем очень скоро. Об исполнении желаний без 
        настойчивых усилий с вашей стороны не может быть и речи. 
        `
    },
    53: {
        hHex: [1,1,0,1,0,0],
        hNum: `<p>Гексограмма № 53<\p>`,
        hName: `<p>Цзянь - Течение</p>`,
        baseTxt: `
        Если Вы будете продвигаться вперед, тщательно продумывая 
        каждый шаг, успехи, удача не изменит Вам и в дальнейшем. 
        Счастье и впредь останется Вашим спутником, если. Не 
        поддаваясь на уговоры, Вы не станете опережать события. У 
        черепахи не меньше шансов прийти первой к финишу, чем у 
        зайца. Вы в начале долгого пути. Желание в конце концов 
        исполнится. Финансовые дела существенно поправятся. Вместе с 
        тем в Вашей повседневной деятельности возникнут ограничения. 
        Возможно Вы поменяете место жительства. Ждите встречи с 
        дальним родственником, которого не видели очень давно. 
        `
    },
    54: {
        hHex: [0,0,1,0,1,1],
        hNum: `<p>Гексограмма № 54<\p>`,
        hName: `<p>Гуй-мэй - Невеста</p>`,
        baseTxt: `
        Всегда и во всем будьте осторожны, особенно в любовных делах. 
        Происходящее воспринимайте спокойно и хладнокровно, иначе 
        можете попасть в очень неприятное положение. Исполнение 
        желания затягивается. Это период, когда лучше всего ждать и 
        думать. Одновременно это период, когда доходы превысят 
        расходы. Ближайшее время очень благоприятно для подготовки к 
        следующему, более позитивному периоду. Обстоятельства 
        потребуют осуществить контроль эмоций. Во времена перемен, 
        поворотов в жизненном курсе важно не поддаваться эмоциям - и 
        приятным и неприятным. Вас ждет новость к которой Вы не 
        подготовленны.  
        `
    },
    55: {
        hHex: [0,1,0,0,1,1],
        hNum: `<p>Гексограмма № 55<\p>`,
        hName: `<p>Фын - Изобилие</p>`,
        baseTxt: `
        Эта гексаграмма символизирует осеннюю жатву, сбор богатого 
        урожая и означает, что Ваша счастливая звезда ярко освещает 
        Ваши дела. Они идут успешно и ровно, а в будущем, возможно 
        пойдут успешнее и ровнее. Не забывайте о том, что для Вас очень 
        важно всегда быть хорошо информированным во всех текущих 
        делах и что определенную часть заработанных денег следует 
        откладывать. Данный период особенно благоприятен для дел, 
        связанных с сельским хозяйством, искусством и бизнесом. 
        Однако, хотя сейчас Вам сопутствует успех, нет полной 
        уверенности в том, что желания Ваши исполнятся. Вас ждет 
        интересное знакомство с военнослужителем. Остерегайтесь 
        интриги со стороны сослуживцев. 
        `
    },
    56: {
        hHex: [1,1,0,0,1,0],
        hNum: `<p>Гексограмма № 56<\p>`,
        hName: `<p>Люй -Странствие</p>`,
        baseTxt: `
        Есть все предпосылки для успеха в делах. Успешно пройдет и 
        заграничная командировка, если таковая планируется. Вы очень 
        честолюбивы, будьте осмотрительны, чтобы не испортить 
        отношения с друзьями и коллегами по работе. Желание 
        исполнится, если претензии Ваши не слишком высоки и Вы не 
        ждете слишком многого. Вы очень и очень нервничаете по 
        поводу некоего неприятного события. Это не разумно, забудьте и 
        не вспоминайте. У Вас есть потребность вырваться в своих делах 
        вперед. Примите предостережение от излишней поспешности. 
        Это не то время или ситуация, когда нужен натиск. Главный 
        совет для данного периода - проявить терпение.
        `
    },
    57: {
        hHex: [1,0,0,1,0,0],
        hNum: `<p>Гексограмма № 57<\p>`,
        hName: `<p>Сунь - Проникновение</p>`,
        baseTxt: `
        Положение Ваше запутано и в данный момент не так просто в 
        нем разобраться и оценить его. Вы склонны изображать события 
        слишком мрачно. Следуйте по пути, который укажет человек из 
        Вашего окружения, и вы скоро убедитесь, что это наилучший 
        выход. Самое позднее через пять месяцев судьба изменится к 
        лучшему. Что-то препятствует исполнению Ваших желаний, 
        устранить помехи Вам поможет пожило мужчина, который не 
        является Вашим близким знакомым. В данный период ни в коем 
        случае не позволяйте уговорить себя на такие действия, которые 
        считаются неуместными и ошибочными. К Вам проявит интерес 
        одна коммерческая организация. Ждите гостей. 
        `
    },
    58: {
        hHex: [0,0,1,0,0,1],
        hNum: `<p>Гексограмма № 58<\p>`,
        hName: `<p>Дуй - Радость</p>`,
        baseTxt: `
        Счастье уже на пути к Вам, оно развеет нынешнее подавленное 
        настроение, Вы чувствуете тщетность зря потраченного усилия, 
        бесплодности недавнего путешествия, поездки. Этот факт 
        вызывает у Вас уныние. Но то, что происходит, как нельзя кстати 
        подходит для рационального отбора решения из всех 
        существующих, которыми пренебрегли в недалеком прошлом. 
        Если труба засорилась, время чистить ее. Не принимайте за 
        чистую монету сплетни, которые Ваши недруги сеют вокруг Вас. 
        Не пренебрегайте добрым советом Ваших близких. Вам принесет 
        удачу торговля. Настоящий период характерен необходимостью 
        сохранять спокойствие и хладнокровие 
        `
    },
    59: {
        hHex: [1,0,1,1,0,0],
        hNum: `<p>Гексограмма № 59<\p>`,
        hName: `<p>Хуань - Раздробление</p>`,
        baseTxt: `
        После долгого периода неудач вновь восходит солнце. Оно 
        принесет Вам все, к чему Вы стремитесь. Вас ожидает длительное 
        путешествие, результатами которого вы будете довольны. В 
        ближайшее время у Вас появится конкурент по делам, не 
        связанным с основной работой. Вам он не страшен, так как слабее 
        Вас. Настоящий период нуждается  не в расслаблении, а в 
        мобилизации всех сил и возможностей для закрепления успеха. 
        От всех Ваших дел должны исходить настойчивость и 
        целенаправленность. Возможны финансовые затруднения, 
        связанные с некоторыми непредвиденными расходами. Не 
        впутывайтесь в конфликт, который разыгрывается у Вас на 
        службе.  
        `
    },
    60: {
        hHex: [0,0,1,1,0,1],
        hNum: `<p>Гексограмма № 60<\p>`,
        hName: `<p>Цзе - Ограничение</p>`,
        baseTxt: `
        Вы полны сил и Вас ждет благоприятный исход от задуманных 
        целевых действий. У Вас хорошее настроение и все складывается 
        как нельзя лучше в общественных сферах. Активно принимайтесь 
        за дело, помня о необходимой предусмотрительности, иначе все 
        усилия пойдут прахом. Не принимайте слишком поспешно то 
        предложение, которое Вам только что сделали или вот-вот 
        сделают. Вполне возможно, что оно гораздо менее выгодно Вам, 
        чем на первый взгляд кажется. То же самое относится к Вашим 
        новым любовным и дружеским связям. Разумные и реальные 
        желания исполнятся. Для путешествий, дальних поездок время не 
        подходящее. Помните пословицу: не рой яму другому, сам в нее 
        попадешь. Это относится к настоящему периоду.
        `
    },
    61: {
        hHex: [0,0,1,1,0,0],
        hNum: `<p>Гексограмма № 61<\p>`,
        hName: `<p>Чжун-фу - Внутренняя правда</p>`,
        baseTxt: `
        Работать не одному, а в сотрудничестве с другими для вас сейчас 
        наиболее выгодно. Остерегайтесь переоценивать свои 
        умственные способности, чтобы не стать спесивым и 
        невыдержанным. Это может поставить под угрозу осуществление 
        Ваших планов. Постарайтесь быть скромнее и сдержаннее. Лишь 
        в этом случае, если желания Ваши разумны и честны, они 
        исполнятся. Начальство в ближайшее время обратит внимание на 
        Ваши способности и возможности, оценит их по достоинству, что 
        естественно поможет Вам в движении по пути успеха. Вы 
        получите неприятное сообщение от своих близких.
        `
    },
    62: {
        hHex: [1,1,0,0,1,1],
        hNum: `<p>Гексограмма № 62<\p>`,
        hName: `<p>Сяо-го - Переразвитие малого</p>`,
        baseTxt: `
        К Вам проявит интерес очень хороший знакомый. Не 
        самообольщайтесь его хорошим к Вам отношением. Держите 
        себя сдержанно, но изгоните прочь эгоизм. Возможно вы 
        разочаруетесь в том, кого любите, но не воспринимайте все 
        слишком трагично. Наилучший шанс, который вернее любого 
        другого способствовал бы исполнению Вашего желания, Вы 
        упустили. Но скоро появится новый. Данный период отмечен 
        возможностью хороших заработков, однако для дальних поездок 
        подходит мало. В настоящее время вы придаете много значения 
        мелочам и тем самым размениваете, унижаете себя. Ждите 
        встречи с очень влиятельными людьми из сферы Вашей 
        деятельности.
        `
    },
    63: {
        hHex: [0,1,0,1,0,1],
        hNum: `<p>Гексограмма № 63<\p>`,
        hName: `<p>Цзи-цзи - Уже конец</p>`,
        baseTxt: `
        Вас ждет кризис. Тяжелый этап, но короткий. Сейчас, как нельзя 
        кстати, нужны обдумывание и размышление, потому что свет и 
        тень еще переплетены и сомнения, колебания могут омрачить 
        радость от приезда близкого человека. Этот этап своего рода 
        испытание на мужество. Вы не можете потерпеть неудачу. Если 
        вы поссоритесь с кем-либо, срочно обратитесь к третьему лицу с 
        просьбой выступить посредником между Вами. Не поддавайтесь 
        соблазну вновь повторить однажды достигнутый успех. Если как 
        следует обдумаете этот совет и последуете ему, наградой вам 
        будет полное осуществление Ваших желаний. В данный момент 
        не бросайте все силы на новое начинание, оно не приведет к 
        успеху.
        `
    },
    64: {
        hHex: [1,0,1,0,1,0],
        hNum: `<p>Гексограмма № 64<\p>`,
        hName: `<p>Еще не конец</p>`,
        baseTxt: `
        Обратите внимание на круто меняющуюся обстановку, и Вы 
        поймете, как нужны сейчас такие качества, как осмотрительность, 
        внимание, хладнокровие. Вас пытаются вовлечь в группу, которая 
        выступает с новыми идеями. Воздержитесь от такого шага. 
        Переключите свое внимание на благоустройство семейных дел, 
        на восстановление отдельных родственных связей, которые были 
        прерваны очень давно. Вы обдумываете очень важное решение. 
        Правильный акцент в этом вопросе поможет поставить близкий 
        человек. Вас ждет одно серьезное испытание, которое выдержите. 
        Ваша заветная мечта осуществится не скоро.  
        `
    }
}
